**Job Title:** Presales Consultant
**Location:** Singapore

**Company Overview:**
Red Dot Analytics (RDA) is a pioneering Singapore-based company dedicated to enabling sustainable, energy-efficient operations for data centers worldwide. Leveraging cutting-edge AI and digital twin technology, our flagship platform, DCVerse, creates cognitive digital twins that allow data center operators to simulate, optimize, and, where permitted, automatically control cooling and related infrastructure in real time. We are IMDA-accredited and backed by leading VCs like Granite Asia, demonstrating our stability and potential. At RDA, we are committed to reducing energy consumption, improving resilience, and managing risk in high-density, AI-era facilities, making a tangible impact on environmental sustainability.

**Role Overview:**
We are expanding our high-impact team and seeking a highly experienced Presales Consultant to serve as a technical Subject Matter Expert (SME) within our sales process. In this pivotal individual contributor role, you will be instrumental in demonstrating the transformative power of RDA’s DCVerse platform, translating complex technical capabilities into compelling, customized solutions that address our clients' most critical data center challenges.

**How You'll Make an Impact:**
*   **Drive Technical Sales & Solution Design:** Act as the primary technical advisor for RDA's digital twin solutions throughout the entire sales cycle, from initial engagement to deal closure.
*   **Deeply Understand Client Needs:** Attend product demonstrations and engage in in-depth customer discussions to identify critical pain points and specific requirements related to data center operations.
*   **Craft Bespoke Solutions:** Design and present tailored solutions utilizing the DCVerse platform, clearly articulating how our technology addresses and solves complex client challenges.
*   **Lead Stakeholder Engagement:** Effectively communicate complex technical and domain expertise to a diverse range of stakeholders, including IT teams, facilities/operations teams, and senior business leaders across various client types, from medium-sized data centers to hyperscalers.
*   **Support Sales Cycle Acceleration:** Collaborate closely with the sales team, providing crucial technical insights and strategic guidance to facilitate successful deal closures.

**What You'll Bring to the Team:**

**Minimum/Core Requirements:**
*   Demonstrable deep domain expertise in data center operations, with a strong focus on energy efficiency, cooling, and thermal management. Hands-on experience in these areas is highly valued.
*   Proven ability to engage effectively with customers, including excellent communication, presentation, and stakeholder management skills. This includes adeptness at interacting with diverse technical and business decision-makers throughout a B2B sales cycle.
*   A track record of designing and presenting complex technical solutions to enterprise clients.
*   Demonstrated experience operating as a senior individual contributor within a technical capacity.
*   Proficiency in English.
*   Based in Singapore and willing to work in a hybrid model.

**Preferred/Bonus Requirements:**
*   Experience with digital twin technology or AI/ML applications specifically within data centers.
*   Expertise in overall data center design principles and practices.
*   Prior experience in a Presales Consultant, Solutions Architect, or similar customer-facing technical role within the data center industry or a related critical infrastructure technology sector.

**What We Offer:**
*   **Pioneering Impact:** Join a company at the forefront of AI and digital twin technology for data centers, making a significant impact on global energy efficiency and sustainability.
*   **High Growth Environment:** Be part of a rapidly scaling team in a booming market, with substantial opportunities for professional development and career advancement, potentially into leadership roles.
*   **World-Class Leadership:** Work alongside and learn from renowned experts, including our Chief Scientist, a highly respected academic in green data centers and AI systems.
*   **Innovative Technology:** Contribute to a platform (DCVerse) built on unique physics-informed ML and reinforcement learning approaches, validated for substantial energy savings in tropical data centers.
*   **Collaborative Culture:** Thrive in an environment that values deep technical rigor, measurable impact, and experimentation, backed by top-tier venture capital.

If you are a seasoned technical expert passionate about data center innovation and sustainability, and thrive in a customer-facing role, we encourage you to apply and help us shape the future of mission-critical infrastructure.